JorgeArturo/Tutoriales_LPC54114/Tutorial_5/board/pin_mux.h
/*! @name PIO0_26 (number 4), J1[3]/JS5[1]/U10[5]/P0_26-FC4_SDAX
  @{ */
#define BOARD_FC4_SDAX_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_FC4_SDAX_PIN 26U /*!<@brief 0U pin index: 26 */
                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSecureMCUPins(void); /* Function assigned for the Cortex-M4F */

#define PIO018_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO018_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO019_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO019_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO020_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO020_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO12_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO12_FUNC_ALT4 0x04u         /*!<@brief Selects pin function.: Alternative connection 4. */

/*! @name PIO0_18 (number 58), J1[11]/U5[2]/P0_18-FC5_TXD_SCL_MISO
  @{ */
#define BOARD_SPI_FLASH_MISO_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_SPI_FLASH_MISO_PIN 18U /*!<@brief 0U pin index: 18 */
                                     /* @} */

/*! @name PIO0_19 (number 59), J1[9]/J2[8]/U5[6]/P0_19-FC5_SCK-SPIFI_CSn
  @{ */
#define BOARD_SPI_FLASH_SCK_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_SPI_FLASH_SCK_PIN 19U /*!<@brief 0U pin index: 19 */
                                    /* @} */

/*! @name PIO0_20 (number 60), J1[13]/U5[5]/P0_20-FC5_RXD_SDA_MOSI
  @{ */
#define BOARD_SPI_FLASH_MOSI_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_SPI_FLASH_MOSI_PIN 20U /*!<@brief 0U pin index: 20 */
                                     /* @} */

/*! @name PIO1_2 (number 16), J9[7]/JS8[1]/U5[1]/P1_2-FC5_SSEL3
  @{ */
#define BOARD_SPI_FLASH_CS_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_SPI_FLASH_CS_PIN 2U  /*!<@brief 1U pin index: 2 */
                                   /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSPI_FLASHPins(void); /* Function assigned for the Cortex-M4F */

#define PIO011_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO011_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO012_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO012_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO013_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO013_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO014_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO014_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO022_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO022_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO023_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO023_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO023_I2CSLEW_I2C_MODE 0x00u /*!<@brief Controls slew rate of I2C pad.: I2C mode. */
#define PIO024_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO024_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO024_I2CSLEW_I2C_MODE 0x00u /*!<@brief Controls slew rate of I2C pad.: I2C mode. */
#define PIO04_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO04_FUNC_ALT0 0x00u         /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name PIO0_4 (number 38), J4[7]/U9[12]/SW3/BRIDGE_T_INTR-ISP1
  @{ */
#define BOARD_BRIDGE_T_INTR_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_BRIDGE_T_INTR_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_BRIDGE_T_INTR_PIN 4U    /*!<@brief 0U pin index: 4 */
                                      /* @} */

/*! @name PIO0_11 (number 46), J4[4]/U9[13]/BRIDGE_T_SCK
  @{ */
#define BOARD_BRIDGE_T_SCK_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_BRIDGE_T_SCK_PIN 11U /*!<@brief 0U pin index: 11 */
                                   /* @} */

/*! @name PIO0_12 (number 47), J4[2]/U9[11]/BRIDGE_T_MOSI
  @{ */
#define BOARD_BRIDGE_T_MOSI_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_BRIDGE_T_MOSI_PIN 12U /*!<@brief 0U pin index: 12 */
                                    /* @} */

/*! @name PIO0_13 (number 48), J4[3]/U15[4]/BRIDGE_T_MISO
  @{ */
#define BOARD_BRIDGE_T_MISO_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_BRIDGE_T_MISO_PIN 13U /*!<@brief 0U pin index: 13 */
                                    /* @} */

/*! @name PIO0_14 (number 49), J2[12]/J4[1]/U9[14]/BRIDGE_T_SSEL-SPIFI_IO3
  @{ */
#define BOARD_BRIDGE_T_SSEL_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_BRIDGE_T_SSEL_PIN 14U /*!<@brief 0U pin index: 14 */
                                    /* @} */

/*! @name PIO0_22 (number 63), J4[8]/P0_22-BRIDGE_GPIO
  @{ */
#define BOARD_BRIDGE_GPIO_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_BRIDGE_GPIO_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_BRIDGE_GPIO_PIN 22U   /*!<@brief 0U pin index: 22 */
                                    /* @} */

/*! @name PIO0_23 (number 1), J4[9]/JS3[1]/JS4[3]/U10[7]/U12[D6]/BRIDGE_SCL
  @{ */
#define BOARD_BRIDGE_SCL_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_BRIDGE_SCL_PIN 23U /*!<@brief 0U pin index: 23 */
                                 /* @} */

